<script setup>
import ButtonComponent from './button/ButtonComponent.vue'
import { buttons } from './button/setup'

const imgSize = () => {
  let images = document.getElementsByTagName('img')
  const imagesArray = Array.from(images)
  imagesArray.forEach((element) => {
    element.style.width = `100%`
    element.style.margin = `10px 0`
  })
}
</script>

<template>
  <div class="container">
    <div class="btns">
      <ButtonComponent v-for="button in buttons" :button="button" />
    </div>
    <div contenteditable="true" @input="imgSize">
      <p>
        Таким образом консультация с широким активом представляет собой
        интересный эксперимент проверки позиций, занимаемых участниками в
        отношении поставленных задач. С другой стороны постоянное
        информационно-пропагандистское обеспечение нашей деятельности
        представляет собой интересный эксперимент проверки форм развития.
        Идейные соображения высшего порядка, а также укрепление и развитие
        структуры влечет за собой процесс внедрения и модернизации
        соответствующий условий активизации. Задача организации, в особенности
        же реализация намеченных плановых заданий играет важную роль в
        формировании дальнейших направлений развития. Повседневная практика
        показывает, что постоянное информационно-пропагандистское обеспечение
        нашей деятельности играет важную роль в формировании существенных
        финансовых и административных условий.
      </p>
      <h1 class="h1">Смотрите какие обезьянки</h1>
      <img
        src="https://unsplash.com/photos/9Q0G5ZaWJjI/download?ixid=MnwxMjA3fDB8MXxzZWFyY2h8NDl8fG1vbmtleXN8ZW58MHx8fHwxNjM4NzE0Mjgz&force=true&w=1920"
      />
      <p>
        Таким образом консультация с широким активом представляет собой
        интересный эксперимент проверки позиций, занимаемых участниками в
        отношении поставленных задач. С другой стороны постоянное
        информационно-пропагандистское обеспечение нашей деятельности
        представляет собой инйцу шо шщйоц ущойц ущошцщйуо йцщуо йщцоу щйоу
        шщйцош ущйтересный эксперимент проверки форм развития. Идейные
        соображения высшего порядка, а также укрепление и развитие структуры
        влечет за собой процесс внедрения и модернизации соответствующий условий
        активизации. Задача организации, в особенности же реализация намеченных
        плановых заданий играет важную роль в формировании дальнейших
        направлений развития. Повседневная практика показывает, что постоянное
        информационно-пропагандистское обеспечение нашей деятельности играет
        важную роль в формировании существенных финансовых и административных
        условий.
      </p>
      <p>
        Товарищи! новая модель организационной деятельности требуют от нас
        анализа направлений прогрессивного развития. Задача организации, в
        особенности же постоянный количественный рост и сфера нашей активности
        требуют от нас анализа позиций, занимаемых участниками в отношении
        поставленных задач. Задача организации, в особенности же реализация
        намеченных плановых заданий требуют от нас анализа системы обучения
        кадров, соответствует насущным потребностям.
      </p>
    </div>
  </div>
</template>

<style scoped>
img {
  width: 100%;
  margin: 10px 0;
}
p {
  padding: auto;
  width: 75vw;
  line-height: 19px;
  font-size: 15px;
  font-style: normal;
  font-weight: 400;
}
.container {
  background-color: #1e1e1e;
  max-width: 100vw;
  height: 100%;
  padding: 95px 65px;
  text-align: left;
  caret-color: white;
  color: #eaeaea;
}
.h1 {
  color: #ffffff;
  font-weight: 400;
}
.btns {
  display: flex;
  justify-content: start;
  margin-bottom: 40px;
}
</style>
